{
    "en": {
      "title": "Welcome to Panda",
      "intro": "Explore my website to learn about my skills, projects, and services. Each section is designed to showcase what I can offer.",
      "explore": "Explore",
      "home_title": "Home",
      "home_description": "Your starting point to navigate the site and discover all sections.",
      "about_title": "About Me",
      "about_description": "Learn about my experience, approach, and passion for development.",
      "services_title": "Services",
      "services_description": "Discover the range of development services I provide, from web to desktop.",
      "portfolio_title": "Portfolio",
      "portfolio_description": "Check out my projects, showcasing tasks and technologies used.",
      "whyus_title": "Why Choose Me",
      "whyus_description": "Understand why I'm the right choice for your project with my expertise and flexibility.",
      "skills_title": "Skills",
      "skills_description": "Explore my technical skills and tools I use to build robust solutions.",
      "testimonials_title": "Testimonials",
      "testimonials_description": "Read feedback from clients and collaborators about my work.",
      "contact_title": "Contact",
      "contact_description": "Get in touch to discuss your project or ask questions.",
      "faq_title": "FAQ",
      "faq_description": "Find answers to common questions about technologies and processes.",
      "login_title": "Login",
      "login_description": "Access your account to manage your profile and settings.",
      "register_title": "Register",
      "register_description": "Create an account to unlock personalized features and services.",
      "build_message": "We're still building! Stay tuned for more updates."
    },
    "ru": {
      "title": "Добро пожаловать в Panda",
      "intro": "Исследуйте мой сайт, чтобы узнать о моих навыках, проектах и услугах. Каждый раздел создан, чтобы показать, что я могу предложить.",
      "explore": "Перейти",
      "home_title": "Главная",
      "home_description": "Начальная точка для навигации по сайту и знакомства со всеми разделами.",
      "about_title": "Обо мне",
      "about_description": "Узнайте о моем опыте, подходе и страсти к разработке.",
      "services_title": "Услуги",
      "services_description": "Ознакомьтесь с перечнем услуг разработки, от веба до десктопа.",
      "portfolio_title": "Портфолио",
      "portfolio_description": "Посмотрите мои проекты, демонстрирующие задачи и технологии.",
      "whyus_title": "Почему выбрать меня",
      "whyus_description": "Поймите, почему я — лучший выбор для вашего проекта благодаря моему опыту и гибкости.",
      "skills_title": "Навыки",
      "skills_description": "Изучите мои технические навыки и инструменты для создания надежных решений.",
      "testimonials_title": "Отзывы",
      "testimonials_description": "Прочитайте отзывы клиентов и коллег о моей работе.",
      "contact_title": "Контакты",
      "contact_description": "Свяжитесь со мной, чтобы обсудить проект или задать вопросы.",
      "faq_title": "FAQ",
      "faq_description": "Найдите ответы на частые вопросы о технологиях и процессах.",
      "login_title": "Вход",
      "login_description": "Войдите в аккаунт, чтобы управлять профилем и настройками.",
      "register_title": "Регистрация",
      "register_description": "Создайте аккаунт, чтобы разблокировать персонализированные функции.",
      "build_message": "Мы всё ещё работаем над собой! Следите за обновлениями."
    },
    "uk": {
      "title": "Ласкаво просимо до Panda",
      "intro": "Досліджуйте мій сайт, щоб дізнатися про мої навички, проєкти та послуги. Кожен розділ створений, щоб показати, що я можу запропонувати.",
      "explore": "Дізнатися",
      "home_title": "Головна",
      "home_description": "Стартова точка для навігації сайтом і знайомства з усіма розділами.",
      "about_title": "Про мене",
      "about_description": "Дізнайтесь про мій досвід, підхід і пристрасть до розробки.",
      "services_title": "Послуги",
      "services_description": "Ознайомтеся з переліком послуг розробки, від вебу до десктопу.",
      "portfolio_title": "Портфоліо",
      "portfolio_description": "Перегляньте мої проєкти, що демонструють задачі та технології.",
      "whyus_title": "Чому обрати мене",
      "whyus_description": "Зрозумійте, чому я — найкращий вибір для вашого проєкту завдяки досвіду та гнучкості.",
      "skills_title": "Навички",
      "skills_description": "Дослідіть мої технічні навички та інструменти для створення надійних рішень.",
      "testimonials_title": "Відгуки",
      "testimonials_description": "Прочитайте відгуки клієнтів і колег про мою роботу.",
      "contact_title": "Контакти",
      "contact_description": "Зв’яжіться зі мною, щоб обговорити проєкт або задати питання.",
      "faq_title": "FAQ",
      "faq_description": "Знайдіть відповіді на часті питання про технології та процеси.",
      "login_title": "Вхід",
      "login_description": "Увійдіть в акаунт, щоб керувати профілем і налаштуваннями.",
      "register_title": "Реєстрація",
      "register_description": "Створіть акаунт, щоб розблокувати персоналізовані функції.",
      "build_message": "Ми ще працюємо над собою! Слідкуйте за оновленнями."
    },
    "es": {
      "title": "Bienvenido a Panda",
      "intro": "Explora mi sitio web para conocer mis habilidades, proyectos y servicios. Cada sección está diseñada para mostrar lo que puedo ofrecer.",
      "explore": "Explorar",
      "home_title": "Inicio",
      "home_description": "Tu punto de partida para navegar por el sitio y descubrir todas las secciones.",
      "about_title": "Sobre Mí",
      "about_description": "Conoce mi experiencia, enfoque y pasión por el desarrollo.",
      "services_title": "Servicios",
      "services_description": "Descubre la gama de servicios de desarrollo que ofrezco, desde web hasta escritorio.",
      "portfolio_title": "Portafolio",
      "portfolio_description": "Echa un vistazo a mis proyectos, mostrando tareas y tecnologías utilizadas.",
      "whyus_title": "Por Qué Elegirme",
      "whyus_description": "Entiende por qué soy la elección correcta para tu proyecto con mi experiencia y flexibilidad.",
      "skills_title": "Habilidades",
      "skills_description": "Explora mis habilidades técnicas y herramientas que uso para crear soluciones robustas.",
      "testimonials_title": "Testimonios",
      "testimonials_description": "Lee comentarios de clientes y colaboradores sobre mi trabajo.",
      "contact_title": "Contacto",
      "contact_description": "Ponte en contacto para discutir tu proyecto o hacer preguntas.",
      "faq_title": "FAQ",
      "faq_description": "Encuentra respuestas a preguntas comunes sobre tecnologías y procesos.",
      "login_title": "Iniciar Sesión",
      "login_description": "Accede a tu cuenta para gestionar tu perfil y configuraciones.",
      "register_title": "Registrarse",
      "register_description": "Crea una cuenta para desbloquear funciones personalizadas.",
      "build_message": "¡Todavía estamos construyendo! Mantente atento a más actualizaciones."
    },
    "fr": {
      "title": "Bienvenue chez Panda",
      "intro": "Explorez mon site pour découvrir mes compétences, projets et services. Chaque section est conçue pour montrer ce que je peux offrir.",
      "explore": "Explorer",
      "home_title": "Accueil",
      "home_description": "Votre point de départ pour naviguer sur le site et découvrir toutes les sections.",
      "about_title": "À Propos",
      "about_description": "Découvrez mon expérience, mon approche et ma passion pour le développement.",
      "services_title": "Services",
      "services_description": "Découvrez la gamme de services de développement que je propose, du web au bureau.",
      "portfolio_title": "Portfolio",
      "portfolio_description": "Jetez un œil à mes projets, mettant en avant les tâches et technologies utilisées.",
      "whyus_title": "Pourquoi Me Choisir",
      "whyus_description": "Comprenez pourquoi je suis le bon choix pour votre projet grâce à mon expertise et ma flexibilité.",
      "skills_title": "Compétences",
      "skills_description": "Explorez mes compétences techniques et les outils que j'utilise pour créer des solutions robustes.",
      "testimonials_title": "Témoignages",
      "testimonials_description": "Lisez les commentaires de clients et collaborateurs sur mon travail.",
      "contact_title": "Contact",
      "contact_description": "Contactez-moi pour discuter de votre projet ou poser des questions.",
      "faq_title": "FAQ",
      "faq_description": "Trouvez des réponses aux questions courantes sur les technologies et processus.",
      "login_title": "Connexion",
      "login_description": "Accédez à votre compte pour gérer votre profil et vos paramètres.",
      "register_title": "Inscription",
      "register_description": "Créez un compte pour débloquer des fonctionnalités personnalisées.",
      "build_message": "Nous sommes encore en construction ! Restez à l'écoute pour plus de mises à jour."
    },
    "pt": {
      "title": "Bem-vindo ao Panda",
      "intro": "Explore meu site para conhecer minhas habilidades, projetos e serviços. Cada seção é projetada para mostrar o que posso oferecer.",
      "explore": "Explorar",
      "home_title": "Início",
      "home_description": "Seu ponto de partida para navegar pelo site e descobrir todas as seções.",
      "about_title": "Sobre Mim",
      "about_description": "Conheça minha experiência, abordagem e paixão por desenvolvimento.",
      "services_title": "Serviços",
      "services_description": "Descubra a gama de serviços de desenvolvimento que ofereço, da web ao desktop.",
      "portfolio_title": "Portfólio",
      "portfolio_description": "Confira meus projetos, destacando tarefas e tecnologias utilizadas.",
      "whyus_title": "Por Que Me Escolher",
      "whyus_description": "Entenda por que sou a escolha certa para seu projeto com minha expertise e flexibilidade.",
      "skills_title": "Habilidades",
      "skills_description": "Explore minhas habilidades técnicas e ferramentas que uso para criar soluções robustas.",
      "testimonials_title": "Depoimentos",
      "testimonials_description": "Leia comentários de clientes e colaboradores sobre meu trabalho.",
      "contact_title": "Contato",
      "contact_description": "Entre em contato para discutir seu projeto ou fazer perguntas.",
      "faq_title": "FAQ",
      "faq_description": "Encontre respostas para perguntas comuns sobre tecnologias e processos.",
      "login_title": "Login",
      "login_description": "Acesse sua conta para gerenciar seu perfil e configurações.",
      "register_title": "Registrar",
      "register_description": "Crie uma conta para desbloquear recursos personalizados.",
      "build_message": "Ainda estamos construindo! Fique ligado para mais atualizações."
    }
  }