{
    "en": {
      "title": "Why Choose Me",
      "intro": "Discover why I'm the right choice for your project, bringing expertise, flexibility, and practical solutions.",
      "versatility_title": "Full-Stack Expertise",
      "versatility_description": "I cover the entire development cycle, from front-end (React, Next.js) to back-end (NestJS, Express), databases (PostgreSQL, MongoDB), and DevOps (Docker, Nginx).",
      "flexibility_title": "Web & Desktop Solutions",
      "flexibility_description": "I build secure admin panels, real-time apps with WebSocket, or desktop apps with Electron, tailored to your needs.",
      "practicality_title": "Clean & Maintainable Code",
      "practicality_description": "My focus is on readable, maintainable code that simplifies future updates, avoiding unnecessary complexity.",
      "independence_title": "Proven Independence",
      "independence_description": "I adapt quickly to projects, delivering solutions with minimal guidance, as shown in my rapid onboarding to complex systems.",
      "deployment_title": "Seamless Deployment",
      "deployment_description": "I handle deployment from scratch to production, including domain setup, SSL, and hosting on cloud or local servers.",
      "innovation_title": "Cutting-Edge Innovation",
      "innovation_description": "I integrate modern tools like local LLMs (Ollama) for AI-driven features, keeping your project ahead of the curve."
    },
    "ru": {
      "title": "Почему выбрать меня",
      "intro": "Узнайте, почему я — лучший выбор для вашего проекта, предлагая опыт, гибкость и практичные решения.",
      "versatility_title": "Полный цикл разработки",
      "versatility_description": "Я охватываю весь цикл разработки: фронтенд (React, Next.js), бэкенд (NestJS, Express), базы данных (PostgreSQL, MongoDB) и DevOps (Docker, Nginx).",
      "flexibility_title": "Решения для веба и десктопа",
      "flexibility_description": "Создаю безопасные админ-панели, приложения реального времени с WebSocket или десктопные приложения на Electron под ваши задачи.",
      "practicality_title": "Чистый и поддерживаемый код",
      "practicality_description": "Я фокусируюсь на читаемом и поддерживаемом коде, упрощающем будущие обновления, избегая ненужной сложности.",
      "independence_title": "Доказанная самостоятельность",
      "independence_description": "Быстро адаптируюсь к проектам, предоставляя решения с минимальным руководством, как показал мой опыт быстрого освоения сложных систем.",
      "deployment_title": "Бесшовное развертывание",
      "deployment_description": "Я управляю развертыванием с нуля до продакшна, включая настройку домена, SSL и хостинг на облачных или локальных серверах.",
      "innovation_title": "Передовые инновации",
      "innovation_description": "Интегрирую современные инструменты, такие как локальные LLM (Ollama), для AI-функций, чтобы ваш проект был на шаг впереди."
    },
    "uk": {
      "title": "Чому обрати мене",
      "intro": "Дізнайтесь, чому я — найкращий вибір для вашого проєкту, пропонуючи досвід, гнучкість і практичні рішення.",
      "versatility_title": "Повний цикл розробки",
      "versatility_description": "Я охоплюю весь цикл розробки: фронтенд (React, Next.js), бекенд (NestJS, Express), бази даних (PostgreSQL, MongoDB) і DevOps (Docker, Nginx).",
      "flexibility_title": "Рішення для вебу та десктопу",
      "flexibility_description": "Створюю безпечні адмін-панелі, додатки реального часу з WebSocket або десктопні додатки на Electron під ваші задачі.",
      "practicality_title": "Чистий і підтримуваний код",
      "practicality_description": "Я зосереджуюсь на зрозумілому і підтримуемому коді, що спрощує майбутні оновлення, уникаючи зайвої складності.",
      "independence_title": "Доведена самостійність",
      "independence_description": "Швидко адаптуюся до проєктів, надаючи рішення з мінімальним керівництвом, як показав мій досвід швидкого освоєння складних систем.",
      "deployment_title": "Безшовне розгортання",
      "deployment_description": "Я керую розгортанням з нуля до продакшну, включаючи налаштування домену, SSL і хостинг на хмарних або локальних серверах.",
      "innovation_title": "Передові інновації",
      "innovation_description": "Інтегрую сучасні інструменти, такі як локальні LLM (Ollama), для AI-функцій, щоб ваш проєкт був попереду."
    },
    "es": {
      "title": "Por Qué Elegirme",
      "intro": "Descubre por qué soy la elección adecuada para tu proyecto, ofreciendo experiencia, flexibilidad y soluciones prácticas.",
      "versatility_title": "Experiencia Full-Stack",
      "versatility_description": "Cubro todo el ciclo de desarrollo: front-end (React, Next.js), back-end (NestJS, Express), bases de datos (PostgreSQL, MongoDB) y DevOps (Docker, Nginx).",
      "flexibility_title": "Soluciones Web y de Escritorio",
      "flexibility_description": "Construyo paneles de administración seguros, aplicaciones en tiempo real con WebSocket o aplicaciones de escritorio con Electron, adaptadas a tus necesidades.",
      "practicality_title": "Código Limpio y Mantenible",
      "practicality_description": "Me enfoco en código legible y mantenible que simplifica futuras actualizaciones, evitando complejidades innecesarias.",
      "independence_title": "Independencia Comprobada",
      "independence_description": "Me adapto rápidamente a proyectos, entregando soluciones con mínima guía, como lo demostré al dominar sistemas complejos rápidamente.",
      "deployment_title": "Despliegue Sin Costuras",
      "deployment_description": "Manejo el despliegue desde cero hasta producción, incluyendo configuración de dominio, SSL y alojamiento en servidores locales o en la nube.",
      "innovation_title": "Innovación de Vanguardia",
      "innovation_description": "Integro herramientas modernas como LLMs locales (Ollama) para funciones impulsadas por IA, manteniendo tu proyecto a la vanguardia."
    },
    "fr": {
      "title": "Pourquoi Me Choisir",
      "intro": "Découvrez pourquoi je suis le bon choix pour votre projet, apportant expertise, flexibilité et solutions pratiques.",
      "versatility_title": "Expertise Full-Stack",
      "versatility_description": "Je couvre tout le cycle de développement : front-end (React, Next.js), back-end (NestJS, Express), bases de données (PostgreSQL, MongoDB) et DevOps (Docker, Nginx).",
      "flexibility_title": "Solutions Web et Bureau",
      "flexibility_description": "Je construis des panneaux d'administration sécurisés, des applications en temps réel avec WebSocket ou des applications de bureau avec Electron, adaptées à vos besoins.",
      "practicality_title": "Code Propre et Maintenable",
      "practicality_description": "Je me concentre sur un code lisible et maintenable qui simplifie les futures mises à jour, évitant les complexités inutiles.",
      "independence_title": "Indépendance Prouvée",
      "independence_description": "Je m'adapte rapidement aux projets, livrant des solutions avec un minimum de guidance, comme je l'ai montré en maîtrisant rapidement des systèmes complexes.",
      "deployment_title": "Déploiement Sans Couture",
      "deployment_description": "Je gère le déploiement de zéro à la production, y compris la configuration de domaine, SSL et l'hébergement sur des serveurs locaux ou cloud.",
      "innovation_title": "Innovation de Pointe",
      "innovation_description": "J'intègre des outils modernes comme les LLMs locaux (Ollama) pour des fonctionnalités alimentées par IA, gardant votre projet en avance."
    },
    "pt": {
      "title": "Por Que Me Escolher",
      "intro": "Descubra por que sou a escolha certa para o seu projeto, trazendo expertise, flexibilidade e soluções práticas.",
      "versatility_title": "Expertise Full-Stack",
      "versatility_description": "Eu cubro todo o ciclo de desenvolvimento: front-end (React, Next.js), back-end (NestJS, Express), bancos de dados (PostgreSQL, MongoDB) e DevOps (Docker, Nginx).",
      "flexibility_title": "Soluções Web e Desktop",
      "flexibility_description": "Construo painéis de administração seguros, aplicativos em tempo real com WebSocket ou aplicativos de desktop com Electron, adaptados às suas necessidades.",
      "practicality_title": "Código Limpo e Manutenível",
      "practicality_description": "Meu foco é em código legível e manutenível que simplifica atualizações futuras, evitando complexidades desnecessárias.",
      "independence_title": "Independência Comprovada",
      "independence_description": "Eu me adapto rapidamente a projetos, entregando soluções com mínima orientação, como demonstrei ao dominar sistemas complexos rapidamente.",
      "deployment_title": "Implantação Sem Costura",
      "deployment_description": "Eu gerencio a implantação do zero à produção, incluindo configuração de domínio, SSL e hospedagem em servidores locais ou na nuvem.",
      "innovation_title": "Inovação de Ponta",
      "innovation_description": "Integro ferramentas modernas como LLMs locais (Ollama) para funcionalidades impulsionadas por IA, mantendo seu projeto na vanguarda."
    }
  }